In [1]:
import seaborn as sns
planets = sns.load_dataset("planets")
df = planets.copy()
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [3]:
# is there any nall value
df.isnull().values.any() # true= there is some values missed

True

In [4]:
#hangi degisken ve ne kadar
df.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

In [10]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.0000,1.000000,1.000,2.00,7.0
orbital_period,1035.0,1919.704595,25471.198309,0.0000,4.461268,31.884,487.10,730000.0
mass,513.0,2.638161,3.818617,0.0036,0.229000,1.260,3.04,25.0
distance,808.0,264.069282,733.116493,1.3500,32.560000,55.250,178.50,8500.0
year,1035.0,2009.070531,3.972567,1989.0000,2007.000000,2010.000,2012.00,2014.0

In [ ]:
# set to null values 
df["orbital_period"].fillna( 0, inplace = True)

In [9]:
df.isnull().sum()

method              0
number              0
orbital_period      0
mass              522
distance          227
year                0
dtype: int64

In [21]:
df = planets.copy()
df["orbital_period"].fillna(df.orbital_period.mean(), inplace = True)

In [22]:
df.isnull().sum()

method              0
number              0
orbital_period      0
mass              522
distance          227
year                0
dtype: int64

In [23]:
df.orbital_period.std()

25468.059298366836

In [24]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.000,2.00,7.0
orbital_period,1035.0,2002.917596,25468.059298,0.090706,5.74786,49.532,673.55,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.260,3.04,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.250,178.50,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.000,2012.00,2014.0

In [29]:
df.fillna(df.mean(), inplace = True) # all missing value replace with its var's mean

C:\Users\mkose\AppData\Local\Temp\ipykernel_7620\2622515659.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean(), inplace = True)

In [30]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.000000,2.000000,7.0
orbital_period,1035.0,2002.917596,25468.059298,0.090706,5.74786,49.532000,673.550000,730000.0
mass,1035.0,2.638161,2.687081,0.003600,1.28500,2.638161,2.638161,25.0
distance,1035.0,264.069282,647.663598,1.350000,38.01000,105.490000,264.069282,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.000000,2012.000000,2014.0

In [31]:
df.isnull().sum()

method            0
number            0
orbital_period    0
mass              0
distance          0
year              0
dtype: int64